core/app/Http/Controllers/DepositController.php

select * from `general_settings` limit 1
---
    public function __construct()
    {
        $general = GeneralSetting::first();

select * from `deposits` where `user_id` = 92 and `payment_status` != 0 order by `created_at` desc
select * from `users` where `users`.`id` in (92)
---
    public function depositLog(Request $request)
    {
        $pageTitle = "Transactions";

        $transactions = Deposit::when($request->trx , function($item)use($request){
            $item->where('transaction_id', $request->trx);
        })->when($request->date, function($item) use($request) {
                $item->whereDate('created_at', $request->date);
            })->where('user_id', auth()->id())
            ->latest()->with('user')
            ->where('payment_status', '!=', 0)->get();