core/app/Http/Controllers/OnePayController.php

    public function indexUSDT(){
        $pageTitle = 'Deposit With usdt';
        $user = Auth::user();
        $gatewayMethod = Gateway::where('status', 1)->whereJsonContains('gateway_parameters', ['gateway_currency' => 'usdt'])->first();
---
select * from `gateways` where `status` = 1 and json_contains(`gateway_parameters`, '{\"gateway_currency\":\"usdt\"}') limit 1

    public function usdtConfirm(Request $request)
    {
        $gateway = Gateway::where('status', 1)->whereJsonContains('gateway_parameters', ['gateway_currency' => 'usdt'])->first();

        if ($gateway->min_limit > $request->amount || $gateway->max_limit < $request->amount) {
            $notify[] = ['error', 'Check Deposit Limit!'];
            return back()->withNotify($notify);
        }

        $final_amo = $request->amount + $gateway->charge;

//        if ($request->has('screenshot')) {
//
//            $screenshot = time() . '.' . $request->screenshot->getClientOriginalExtension();
//
//            $request->screenshot->move(filePath('deposit/screenshots'), $screenshot);
//        }

        $deposit = Deposit::create([
            'gateway_id' => $gateway->id,
            'user_id' => auth()->id(),
            'transaction_id' => $request->transaction_id,
            'amount' => $request->amount,
            'rate' => $gateway->rate,
            'charge' => $gateway->charge,
            'final_amount' => $final_amo,
            'number'=> null,
            'screenshot'=> null,
            'payment_status' => 0,
            'payment_type' => 1,
        ]);
---
select * from `gateways` where `status` = 1 and json_contains(`gateway_parameters`, '{\"gateway_currency\":\"usdt\"}') limit 1
insert into `deposits` (`gateway_id`, `user_id`, `transaction_id`, `amount`, `rate`, `charge`, `final_amount`, `number`, `screenshot`, `payment_status`, `payment_type`, `updated_at`, `created_at`) values (36, 92, 'ASWJRISIOPKH6VJ3', '200', '1.00000000', '1.00000000', 201, '', '', 0, 1, '2024-06-03 01:20:27', '2024-06-03 01:20:27')