core/app/Http/Controllers/SiteController.php

select * from `general_settings` limit 1
---
    public function __construct()
    {
        $general = GeneralSetting::first();

select * from `pages` where `name` = 'home' limit 1
select * from `plans` where `status` = 1
---
    public function index()
    {
        $pageTitle = 'Home';
        $sections = Page::where('name', 'home')->first();
        if (!$sections) {
            $sections = Page::create([
                'name' => 'home',
                'sections' => ['about'],
                'slug' => 'home',
                'seo_description' => 'home',
                'page_order' => 1
            ]);
        }

        $plan = Plan::where('status', 1)->get();

select * from `pages` where `slug` = '__service-worker.js' limit 1
---
    public function page(Request $request)
    {

        $page = Page::where('slug', $request->pages)->first();