core/app/Http/Controllers/UserController.php

select * from `general_settings` limit 1
---
    public function __construct()
    {
        $general = GeneralSetting::first();

select * from `payments` where `user_id` = 14 and `payment_status` = 1 order by `created_at` desc limit 1
select sum(`amount`) as aggregate from `payments` where `user_id` = 93 and `payment_status` = 1
select `amount` from `payments` where `user_id` = 93 and `payment_status` = 1 order by `created_at` desc limit 1
select * from `payments` where `user_id` = 93 and `payment_status` = 1 order by `created_at` desc limit 1
select count(*) as aggregate from `payments` where `user_id` = 93
select sum(`withdraw_amount`) as aggregate from `withdraws` where `user_id` = 93 and `status` = 1
select count(*) as aggregate from `user_interests` where `user_id` = 93
select sum(`amount`) as aggregate from `reffered_commissions` where `reffered_by` = 93
select sum(`amount`) as aggregate from `payments` where `user_id` = 93 and `payment_status` = 2
select sum(`withdraw_amount`) as aggregate from `withdraws` where `user_id` = 93 and `status` = 0
select sum(`amount`) as aggregate from `deposits` where `user_id` = 93 and `payment_status` = 1
select sum(`amount`) as aggregate from `transactions` where `user_id` = 93 and `gateway_transaction` = 'trading' and `type` = '+' and date(`created_at`) = '2024-06-03'
select sum(`amount`) as aggregate from `transactions` where `user_id` = 93 and `gateway_transaction` = 'trading' and `type` = '+'
---
    public function dashboard()
    {
        $pageTitle = "Dashboard";
        $user = Auth::user();
        $totalInvest = Payment::where('user_id', Auth::id())->where('payment_status', 1)->sum('amount');
        $currentInvest = Payment::where('user_id', Auth::id())->where('payment_status', 1)->latest()->first('amount');
        $currentPlan = Payment::with('plan')->where('user_id', Auth::id())->where('payment_status', 1)->latest()->first();
        $allPlan = Payment::with('plan')->where('user_id', Auth::id())->latest()->paginate(10, ['*'], 'plan');
        $withdraw = Withdraw::where('user_id', Auth::id())->where('status', 1)->sum('withdraw_amount');
        $interestLogs = UserInterest::with('payment')->where('user_id', Auth::id())->latest()->paginate(10, ['*'], 'log');

        $commison = RefferedCommission::where('reffered_by', Auth::id())->sum('amount');

        $pendingInvest = Payment::where('user_id', Auth::id())->where('payment_status', 2)->sum('amount');
        $pendingWithdraw = Withdraw::where('user_id', Auth::id())->where('status', 0)->sum('withdraw_amount');
        $totalDeposit = Deposit::where('user_id', Auth::id())->where('payment_status', 1)->sum('amount');

        $today['earning'] = Transaction::where('user_id', $user->id)->where('gateway_transaction', 'trading')->where('type', '+')->whereDate('created_at', Carbon::today())->sum('amount');
        $total['earning'] = Transaction::where('user_id', $user->id)->where('gateway_transaction', 'trading')->where('type', '+')->sum('amount');

select * from `rewards` where `rewards`.`id` = '2' limit 1
select * from `reward_requests` where `user_id` = 14 and `reward_id` = '2' limit 1
insert into `reward_requests` (`user_id`, `reward_id`, `amount`, `created_at`, `updated_at`) values (14, '2', 5, '2024-06-03 01:31:02', '2024-06-03 01:31:02')
update `users` set `balance` = 5, `users`.`updated_at` = '2024-06-03 01:31:02' where `id` = 14
---
     public function clm($id)
    {
        $reward = Reward::find($id);
        $model = new RewardRequest();
        $teamSize = depoTeamSize(auth()->id(), 1);

        $totalTeam = teamSize(auth()->id(), 1)+teamSize(auth()->id(), 2)+teamSize(auth()->id(), 3);

        //Already try
        $alreadyTry = RewardRequest::where('user_id', \auth()->id())->where('reward_id', $id)->first();
        if ($alreadyTry){
            return back()->with('error', 'You already get this reward');
        }

        if ($totalTeam > $reward->tteam){
            if ($teamSize >= $reward->size){
                $model->user_id = \auth()->id();
                $model->reward_id = $id;
                $model->amount = $reward->bonus;
                $model->created_at = now();
                $model->updated_at = now();
                $model->save();

                auth()->user()->balance = auth()->user()->balance + $reward->bonus;
                auth()->user()->save();