core/app/Http/Controllers/Admin/HomeController.php

    public function reward(){
        $pageTitle = 'Dashboard';
        $rewards = Reward::get();
---
select * from `rewards`

    public function reward_create(){
        $pageTitle = 'Reward create';
        $rewards = Reward::get();
---
select * from `rewards`

    public function reward_edit($id){
        $pageTitle = 'Reward Edit';
        $data = Reward::find($id);
---
select * from `rewards` where `rewards`.`id` = '1' limit 1

    public function reward_update(Request $request, $id){
        $model = Reward::find($id);
---
select * from `rewards` where `rewards`.`id` = '1' limit 1