core/app/Http/Controllers/Admin/ManageGatewayController.php

select * from `users` where `users`.`id` = 'pending' limit 1
---
    public function depositLog($user = '', $status = null)
    {
        if(!is_int($user)){
            $status = $user;
        }

        $user = User::find($user);

select * from `users` where `users`.`id` in (14, 87, 89)
---
            $manuals->where('payment_status', 3);
        }

        $data['manuals'] = $manuals->where('payment_type', 0)->with('user')->latest()->paginate();

select * from `deposits` where `transaction_id` = 'ASWJRISIOPKH6VJ3' limit 1
select * from `general_settings` limit 1
select * from `gateways` where `gateway_name` = 'bank' limit 1
update `users` set `invested` = 1, `balance` = 300, `users`.`updated_at` = '2024-06-03 01:20:45' where `id` = 92
insert into `transactions` (`trx`, `gateway_id`, `amount`, `currency`, `details`, `charge`, `type`, `user_id`, `payment_status`, `updated_at`, `created_at`) values ('ASWJRISIOPKH6VJ3', 36, '200.00000000', 'USDT', 'Deposit Successfull!', '2.00000000', '+', 92, 1, '2024-06-03 01:20:45', '2024-06-03 01:20:45')
---
    public function depositAccept(Request $request)
    {
        $booking = Deposit::where('transaction_id', $request->trx)->firstOrFail();

        if ($booking->payment_status == 1) {
            $notify[] = ['success', "Payment Confirmed Successfully"];
            return redirect()->back()->withNotify($notify);
        }

        $general = GeneralSetting::first();
        $gateway = Gateway::where('gateway_name', 'bank')->first();

        $booking->payment_status = 1;
        $booking->user->balance = $booking->user->balance + $booking->amount;
        $booking->user->invested = 1;
        $booking->save();
        $booking->user->save();

        Transaction::create([
            'trx' => $booking->transaction_id,
            'gateway_id' => $booking->gateway_id,
            'amount' => $booking->amount,
            'currency' => $general->site_currency,
            'details' => 'Deposit Successfull!',
            'charge' => $gateway->charge,
            'type' => '+',
            'user_id' => $booking->user_id,
            'payment_status' => 1
        ]);