core/app/Http/Helpers/helpers.php

function filePath($folder_name)
{
    $general = GeneralSetting::first();
---
select * from `general_settings` limit 1

function getFile($folder_name, $filename)
{
    $general = GeneralSetting::first();
---
select * from `general_settings` limit 1

function sendMail($key, array $data, $user)
{

    $general = GeneralSetting::first();

    $template =  EmailTemplate::where('name', $key)->first();
---
select * from `general_settings` limit 1
select * from `email_templates` where `name` = 'Commission' limit 1

function content($key)
{
    $general = GeneralSetting::first();

    return SectionData::where('theme', $general->theme)->where('key', $key)->first();
---
select * from `general_settings` limit 1
select * from `section_data` where `theme` = 3 and `key` = 'links.content' limit 1

function element($key, $take = 10)
{
    $general = GeneralSetting::first();

    return SectionData::where('theme', $general->theme)->where('key', $key)->take($take)->get();
---
select * from `general_settings` limit 1
select * from `section_data` where `theme` = 3 and `key` = 'footer.element' limit 10

function template()
{
    $general = GeneralSetting::first();
---
select * from `general_settings` limit 1

function refferMoney($id, $user, $refferal_type, $amount)
{

    $user_id = $id;

    $level = Refferal::where('status', 1)->where('type', $refferal_type)->first();

    $counter = $level ? count($level->level) : 0;

    $general = GeneralSetting::first();

    for ($i = 0; $i < $counter; $i++) {

        if ($user) {
            $comission = ($level->commision[$i] * $amount) / 100;
            $user->balance = $user->balance + $comission;
            $user->save();

            $a = RefferedCommission::create([
                'reffered_by' => $user->id,
                'reffered_to' => $id,
                'commission_from' => $user_id,
                'amount' => $comission,
                'purpouse' => $refferal_type === 'invest' ? 'Return Trading commission' : 'Return Interest Commission'
                // 'purpouse' => $refferal_type === 'invest' ? 'Return invest commission' : 'Return Interest Commission'
            ]);
---
select * from `general_settings` limit 1
update `users` set `balance` = 100, `users`.`updated_at` = '2024-06-05 13:38:11' where `id` = 148
insert into `reffered_commissions` (`reffered_by`, `reffered_to`, `commission_from`, `amount`, `purpouse`, `updated_at`, `created_at`) values (148, 149, 149, 50, 'Return Interest Commission', '2024-06-05 13:38:11', '2024-06-05 13:38:11')

function depoTeamSize($id, $level)
{
    $myref  = showBelow($id);
    $nxt    = $myref;

    for ($i = 1; $i < $level; $i++) {
        $nxt = array();
        foreach ($myref as $uu) {
            $n = showBelow($uu);
            $nxt = array_merge($nxt, $n);
        }
        $myref = $nxt;
    }

    $count = 0;

    foreach ($nxt as $key => $uu) {
        $data = User::with('referrer')->where('id', $uu)->first();
---
select * from `users` where `users`.`id` in (14)

function showBelow($id)
{
    $arr = array();
    $under_ref = User::select('id')->where('reffered_by', $id)->get();
---
select `id` from `users` where `reffered_by` = 14