core/app/Http/Controllers/Auth/RegisterController.php

select * from `general_settings` limit 1
---
    public function __construct()
    {
        $general = GeneralSetting::first();

select * from `general_settings` limit 1
select * from `users` where `ref_id` = '21210210200' limit 1
select * from `users` where `username` = 'devto00' limit 1
---
    public function register(Request $request)
    {

        $general = GeneralSetting::first();

        $signupBonus = $general->signup_bonus;

        $request->validate([
            'reffered_by' => 'sometimes',
            // 'fname' => 'required',
            // 'lname' => 'required',
            'username' => 'required|unique:users',
            // 'phone' => 'required|unique:users',
            'email' => 'required|email|unique:users',
            'password' => 'required|confirmed',
            'g-recaptcha-response' => Rule::requiredIf($general->allow_recaptcha == 1)

        ], [
            // 'fname.required' => 'First name is required',
            // 'lname.required' => 'Last name is required',
            'g-recaptcha-response.required' => 'You Have To fill recaptcha'
        ]);


        $referid = 0;


        if ($request->reffered_by) {
            $userRefer = User::where('ref_id', $request->ref_by)->first();
            if ($userRefer){
                $referUser = User::where('username', $userRefer->username)->first();

select * from `users` where `ref_id` = '21210210200' limit 1
---
    public function create($request, $signupBonus, $referid)
    {
        $userRefer = User::where('ref_id', $request->ref_by)->first();